<?php

namespace App\Models;

// use Illuminate\Contracts\Auth\MustVerifyEmail;
use Illuminate\Database\Eloquent\Factories\HasFactory;
use Illuminate\Foundation\Auth\User as Authenticatable;
use Illuminate\Notifications\Notifiable;
use Laravel\Sanctum\HasApiTokens;

class User extends Authenticatable
{
    use HasApiTokens, HasFactory, Notifiable;

    /**
     * ---------------------------------------------------------------------------------
     * ??
     * ---------------------------------------------------------------------------------
     */
//    const CREATED_AT = 'creation_date';
    /**
     * ---------------------------------------------------------------------------------
     * ??
     * ---------------------------------------------------------------------------------
     */
//    const UPDATED_AT = 'updated_date';
    /**
     * ---------------------------------------------------------------------------------
     * The primary key associated with the table.
     * ---------------------------------------------------------------------------------
     *
     * @var bool
     */
    public $incrementing = false;
    /**
     * ---------------------------------------------------------------------------------
     * table name
     * ---------------------------------------------------------------------------------
     */
    protected $table = 'users';
    /**
     * ---------------------------------------------------------------------------------
     * The primary key associated with the table.
     * ---------------------------------------------------------------------------------
     * @var string
     */
    protected $primaryKey = 'user_id';
    /**
     * ---------------------------------------------------------------------------------
     * The data type of the auto-incrementing ID.
     * ---------------------------------------------------------------------------------
     *
     * @var string
     */
    protected $keyType = 'string';
    /**
     * ---------------------------------------------------------------------------------
     * ??
     * ---------------------------------------------------------------------------------
     */
    protected $attributes = [
        'remember_token' => 'false',
    ];
    /**
     * ---------------------------------------------------------------------------------
     * 대량 할당 불허 컬럼 (공백: 모두 허용)
     * ---------------------------------------------------------------------------------
     */
    protected $guarded = [];
}
